# Setup
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'

# Fundamentals
brew 'zsh'
brew 'vim'
brew 'git'
brew 'autoenv'
brew 'imagemagick'
brew 'ffmpeg'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Python
brew 'python'

# Java & Android
cask 'java'
brew 'gradle'
brew 'android-sdk'

# DBs
brew 'postgresql'


# Apps

cask 'iterm2'
cask 'rowanj-gitx'
cask 'android-studio-canary'
cask 'pycharm-ce'
cask 'fabric'
cask 'sublime-text3'
cask 'google-chrome'
cask 'google-drive'
cask 'dropbox'
cask 'droplr'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'spotify'
cask 'torbrowser'
cask 'daisydisk'
cask 'divvy'
