# Setup
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/command-not-found'

brew 'zsh'
brew 'vim'
brew 'git'
brew 'imagemagick'
brew 'ffmpeg'
brew 'htop'
brew 'fzf'
brew 'jq'

brew 'rbenv'
brew 'ruby-build'
brew 'go'
brew 'java'
brew 'jenv'
brew 'gradle'
brew 'postgresql'
brew 'redis'
brew 'awscli'
brew 'docker'

cask 'iterm2'
cask 'fork'
cask 'sublime-text'
cask 'spotify'
cask 'google-drive'
cask 'visual-studio-code'

cask 'font-sauce-code-pro-nerd-font'
cask 'font-meslo-lg-nerd-font'
