# Setup
tap 'homebrew/bundle'

# For omz plugin command-not-found
tap 'homebrew/command-not-found'

# CLI basics
brew 'zsh'
brew 'vim'
brew 'git'
brew 'imagemagick'
brew 'ffmpeg'
brew 'htop'
brew 'fzf'
brew 'jq'
brew 'colima'

# Languages & support tooling not managed by hermit
brew 'rbenv'
brew 'ruby-build'
brew 'openjdk@21' # Update .config/java/install.sh and .config/java/env.zsh to match
brew 'jenv'

# Apps
cask_args appdir: '/Applications'
cask 'iterm2'
cask 'fork'
cask 'spotify'
cask 'google-drive'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'tailscale'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-meslo-lg-nerd-font'
